/*
	Filename:hello.c
	Author:fairlyy
	Time:2023/3/5
*/
//第一个helloworlf程序 

#include<stdio.h>
int main(){
	printf("hello world");
	return 0;
} 


/*
	计算机是通过采用某种编程语言编写的程序来实现各类复杂的计算。
	我们现代使用的计算机采用的是冯·诺伊曼结构。因此又称作冯·
	诺伊曼计算机。冯·诺伊曼的核心是存储程序原理，它使程序的自
	动执行成为可能。
	
	计算是通过逐条执行程序员编写的指令实现的，计算机定义的机器
	指令称为机器语言；汇编语言将每条机器指令用助记符表示，从而
	提高了程序的可读性和可维护性。高级编程语言是更接近人类自然
	语言的一门编程语言，它的出现极大地提高了代码的可读性和可维
	护性，人们现在使用的编程语言基本上都属于高级编程语言。 
	
	C语言是所有编程语言中影响较大的一门语言，至今仍得到广泛的使用。
	在C语言不断发展过程中，出现了C89，C99，C11标准，新标准增加了新
	的特性，也删除了一些旧的特性，在编写程序时一定要先明确编译器支
	持的标准。
*/ 
